class UserData1:
    name = "Вася"
    surname = "Иванов"
    adress = "проезд Шокальского 3"
    metro = "Люблино"
    phone_number = "+79151882133"
    data= "Choose среда, 29-е октября 2025 г."
    order_period = "двое суток"
    color="чёрный жемчуг"
    comment_courier ="Оплата по карте"
class UserData2:
    name = "Иоган"
    surname = "Булочкин"
    adress = "Улица Безнадежности 999"
    metro = "Свиблово"
    phone_number = "+71112223344"
    data= "Choose четверг, 30-е октября 2025 г."
    order_period= "трое суток"
    color="серая безысходность"
    comment_courier = "Оплата золотом"

class UrlData:
    URL = "https://qa-scooter.praktikum-services.ru/"
    url_dzen = "https://dzen.ru/?yredirect=true"

class CorrectAnswer:
    correct_answer_list = [
        "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
        "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
        "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
        "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
        "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
        "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
        "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
        "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    ]    


